tutorials/multiphase/multiphaseEulerFoam/laminar/injection/constant/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

options
{
    massSource
    {
        type            semiImplicitSource;

        timeStart       0.1;
        duration        5;

        selectionMode   points;
        points
        (
            (0.075 0.2 0.05)
        );

        volumeMode      absolute;

        sources
        {
            thermo:rho.air
            {
                explicit    1e-3; // kg/s
                implicit    0;
            }

            U.air
            {
                explicit    (0 -1e-2 0); // kg*m/s^2
                implicit    0;
            }

            e.air
            {
                explicit    500; // kg*m^2/s^3
                implicit    0;
            }
        }
    }
}


// ************************************************************************* //
